IDEA Open Model
CoordinateSystemMethod Enumeration
Compatible with IDEA StatiCa Beta 20.0
 A system which uses one or more numbers, or coordinates, to uniquely determine the position of a point or other geometric element.
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CoordinateSystemMethod
Public Enumeration CoordinateSystemMethod
Members
Member name | Value | Description
Cartesian | 0 |  The Cartesian coordinate system.
Polar | 1 |  The polar coordinate system.
See Also
Reference
IdeaRS.OpenModel Namespace